Which field of accounting is assigned to external accounting?
A) Statistics and comparative methods
B) Cost and performance accounting
C) Financial accounting
D) Planning / budgeting
C

External accounting...
A) is customizable for each company
B) is designed by works council
C) is determined by chartered accountants
D) is subject to legal rules
D

Who is not an addressee of the financial statement?
A) Owners
B) Creditors
C) Company management
D) Auditor
D

What is not a function of external accounting?
A) Representing company’s financial situation to its stakeholders
B) Planning, monitoring, and controlling of a company‘s operations
C) Financial Reporting/Accounting pursuant to legal rules
D) Preparation of financial statements
B

Operating result is formed by balancing ...
A) Performance and costs
B) Income and Expense
C) Receipt and Expenditure
D) Cash-inflow and cash-outflow
A

Balancing of receipts and expenditures results in ...
A) Operating result
B) Net income
C) Financial balance
D) Payment balance
C

Select the correct definition for receipts!
A) Monetary value of a company‘s delivered economic goods within a period
B) Cash and cash equivalents that flow directly to the company within a period
C) Monetarily assessed increase in value due to performance of services
D) Increase in value within a period (affecting net income)
A

Select the correct definition for costs!
A) Consumption respectively usage of economic goods (affecting net income)
B) Monetarily assessed consumption of goods and services due to the performance of services
C) Monetary value of a company’s acquired economic goods within a period.
D) Cash and cash equivalents that are spent by the company within a period
B

“Monetary value of a company’s acquired economic goods within a period.” is the correct definition for...
A) Expenditure
B) Receipt
C) Expense
D) Revenue
A

“Cash and cash equivalents that are spent by the company within a period.” is the correct definition for..
A) Cash-outflow
B) Cash-inflow
C) Receipt
D) Income
A

The transaction “Payment of machinery, that already has been delivered in the prior period.“ is a(n)...
A) Cash-outflow
B) Cash-outflow and expenditure
C) Receipt
D) Expenditure
A

The transaction „Payment of machinery, that is going to be delivered in the subsequent period.“ is a(n)...
A) Cash-outflow
B) Cash-outflow and expenditure
C) Receipt
D) Expenditure
A

The transaction “Purchase of goods for the amount of 600 € on credit.“ is a(n)...<br>Note:<br>Here it is always assumed that an economic good is obtained by the buyer immediately<br>(and also is delivered immediately in case of sale)
A) Cash-outflow
B) Cash-outflow and expenditure
C) Receipt
D) Expenditure
D

The transaction “Purchase of raw materials via cash payment“ is a(n)
A) Cash-outflow
B) Cash-outflow and expenditure
C) Receipt
D) Cash-inflow and receipts
B

The transaction “Purchase of wooden planks for 200 € on credit.“ is a(n)...<br>Note:<br>As there is no indication when the consumption takes place it is not examined whether there is an expense; i.e.: Expense is considered only with explicit indication of consumption<br>
A) Expenditure
B) Expenditure and Expense
C) Expense
D) Cash-outflow, Expenditure and Expense
A

The transaction “Purchase of wooden planks for 200 € on credit, which are consumed in the next but one period.” is a(n)...
A) Expenditure
B) Expenditure and Expense
C) Expense
D) Cash-outflow, Expenditure and Expense
A

The transaction “Purchase of wooden planks for 200 € on credit, which are consumed immediately.” is a(n)..
A) Expenditure
B) Expenditure and expense
C) Expense
D) Cash-outflow, expenditure and expense
B

The transaction “Scheduled straight-line depreciation of production machinery.“ is a(n)...
A) Expenditure
B) Expenditure and expense
C) Expense
D) Cash-outflow, expenditure and expense
C

The transaction “Non-scheduled depreciation of production machinery.” is a(n)...
A) Expenditure
B) Expenditure and Expense
C) Expense
D) Cash-outflow, expenditure and expense
C

The transaction “Formation of accruals.” is a(n)...
A) Expenditure
B) Expenditure and expense
C) Expense
D) Cash-outflow, Expenditure and expense
C

The transaction Sale of goods for 700 € on credit is a(n)...<br>Note:<br>At time of transaction, income is recorded: “Receivables to Sales 700 " (revenues are a form of income). At the end of period is "Material expenses are entered on Goods account“. The balance of income and expense then forms profit (income > expenses) or loss..<br>
A) Receipt
B) Expenditure
C) Profit
D) Expense
A

The transaction “Decrease in value of a company car.” is a(n)...
A) Expenditure
B) Expenditure an Expense
C) Expense
D) Cash-outflow, expenditure and expense
C

The transaction “Rental payment for a business office via bank transfer.” is a(n)...
A) Expenditure
B) Cash-outflow and Expense
C) Expense
D) Cash-outflow, expenditure and expense
D

The transaction “Purchase of production machinery for the price of 100.000 €.” is a(n)...<br>Note:<br>Since there is no information if purchase is a cash payment or on credit => unclear, whether cash- outflow or no. But here no relevance for answering MCQ.<br>
A) Expenditure
B) Expenditure and expense
C) Expense
D) Cash-outflow, expenditure and expense
A

The transaction “Granting a bank loan in the amount of 1.111 €.” is a(n)...
A) Cash-outflow
B) Receipt
C) Cash-inflow
D) Receipt and cash-inflow
A

The transaction “Repayment of a loan in the amount of 50.000 €.” is a(n)...
A) Cash-outflow
B) Cash-outflow and expenditure
C) Receipt
D) Expenditure
A

The transaction “Cash sale of finished goods for 300 €.” is a(n)...<br>Note:<br>Basically also income (sales revenues), but not provided here as an option.
A) Cash-inflow
B) Cash-inflow and Receipt
C) Earning
D) Expenditure
B

The transaction “Sale of tangible assets for its book value of 5.000 €.” is a(n)...
A) Receipt
B) Expenditure
C) Income
D) Expense
A

The transaction “Sale of finished goods on credit for 600 €.” is a(n)...
A) Cash-inflow
B) Cash-inflow and earning
C) Earning
D) Expenditure
C

The transaction „ Cash sale of finished goods for 600 €.” Is a(n)...
A) Cash-inflow
B) Cash-outflow
C) Expenditure
D) None of the answers above is correct.
A

The transaction “Increase in value of several tangible assets by 100 €.” is a(n)...
A) Earning
B) Earning and income
C) Income
D) Expense
C

The transaction “A customer’s cash payment for services in the amount of 6.000 €.” is a(n)...
A) Earning
B) Earning and income
C) Income
D) Cash-inflow, earning and income
D

The transaction „A loan granted to a fellow company is being repaid.“ is a(n)...
A) Cash-inflow
B) Cash-inflow and earning
C) Earning
D) Expenditure
A

The transaction “Taking a cash loan (e.g. bank loan) in the amount of 95.000 €.” is a(n)...
A) Cash-inflow
B) Cash-outflow
C) Earning
D) Expenditure
A

What of the following applies for the national German commercial law?
A) just the HGB
B) the HGB and GoB
C) the HGB, GoB and IFRS
D) the HGB, GoB, IFRS and US-GAAP
B

Which of the following accounting rules is not legally defined?
A) HGB
B) GoB
C) IFRS
D) US-GAAP
B

If legal rules of the Stock Corporation Act (AktG) for a stock company differ from the HGB, then ...
A) the rules of the HGB prevail.
B) the rules of the IFRS prevail.
C) it needs to be taken into consideration critically, which accounting rules are chosen.
D) the rules of the AktG prevail.
D

Are there any additional rules for merchants and commercial partnerships that are required additionally besides the HGB?
A) Yes, the AktG and - perhaps – branch-specific rules.
B) Yes, the GmbHG and - perhaps – branch-specific rules.
C) Yes, PublG and - perhaps – branch-specific rules.
D) Branch-specific rules perhaps.
C

The not capital market-oriented Langsam OHG that does not have a subsidiary ...
A) does not need to prepare an individual financial statement.
B) needs to prepare an individual financial statement.
C) may prepare a consolidated financial statement to improve their image.
D) has to prepare an individual financial statement as well as a consolidated financial statement.
B

The not capital market-oriented Schnöller OHG based in Germany with subsidiaries at home and abroad has had 150 employees and revenues of about 5 Million € over the last 3 years each...
A) needs to prepare an individual financial statement applying HGB.
B) needs to prepare an individual financial statement applying IFRS.
C) is not allowed to prepare a consolidated financial statement, because the Schnöller OHG does not meet the exemptions contained in § 293 HGB.
D) needs to prepare an individual as well as a consolidated financial statement applying HGB.
A

The capital market-oriented Fast OHG that is based in Germany with subsidiaries at home and abroad has had 150 employees and revenues of about 5 Million € over the last 3 years each...
A) just needs to prepare an individual financial statement.
B) does not need to prepare a consolidated financial statement since the Fast OHG does not meet the exemptions contained § 293 HGB.
C) needs to prepare an individual financial statement and may prepare a consolidated financial statement to improve their image.
D) needs to prepare an individual financial statement applying HGB as well as a consolidated financial statement applying IFRS.
D

The not capital market-oriented Slow AG based in Germany with subsidiaries at home and abroad has had 150 employees and revenues of about 50 Million € over the last 3 years each...
A) needs to prepare an individual financial statement applying HGB, but no consolidated financial statement.
B) needs to prepare an individual financial statement applying HGB and a consolidated financial statement.
C) needs to prepare an individual financial statement applying HGB and a consolidated financial statement applying IFRS.
D) needs to prepare an individual financial statement applying HGB and a consolidated financial statement applying HGB or IFRS.
D

The capital market-oriented Schnöllerle AG that is based in Germany with subsidiaries abroad only ...
A) needs to prepare an individual financial statement applying HGB and a consolidated financial statement applying IFRS.
B) needs to prepare an individual financial statement applying HGB and a consolidated financial statement applying HGB or IFRS.
C) needs to prepare an individual financial statement applying HGB and a consolidated financial statement applying IFRS.
D) needs to prepare an individual financial statement applying HGB and a consolidated financial statement applying HGB and IFRS.
C

To an individual entrepreneur the following commercial rules applies ...
A) only §§ 264 to 289f HGB.
B) only §§ 238 to 263 HGB.
C) only §§ 238 bis 289f HGB.
D) §§ 238 bis 335 HGB.
B

To an AG with subsidiaries the following commercial rules apply ...
A) only §§ 264 to 289f HGB.
B) only §§ 238 to 263 HGB.
C) only §§ 238 to 289f HGB.
D) §§ 238 to 335 HGB.
C

To an OHG the following commercial rules apply ...
A) only §§ 264 to 289f HGB.
B) only §§ 238 to 263 HGB.
C) only §§ 238 to 289f HGB.
D) §§ 238 to 335 HGB.
B

The rules for a group ...
A) are specific.
B) are regulated by the HGB, §§ 238 to 263.
C) are regulated by the HGB, §§ 263 to 289a.
D) refer to the rules that apply for all merchants and for all capital companies.
D

To a GmbH without any subsidiaries the following commercial rules apply ...
A) only §§ 264 to 289f HGB.
B) only §§ 238 to 263 HGB.
C) only §§ 238 to 289f HGB.
D) §§ 238 to 335 HGB.
C

To a GmbH with a subsidiary the following commercial rules apply ...
A) only §§ 264 to 289f HGB.
B) only §§ 238 to 263 HGB.
C) only §§ 238 to 289f HGB.
D) §§ 238 to 335 HGB.
D

To a GmbH without any subsidiaries the following commercial rules apply ...
A) only §§ 264 to 289f HGB.
B) only §§ 238 to 263 HGB and the GmbHG.
C) only §§ 238 to 289f HGB.
D) only §§ 238 to 289f HGB and the GmbHG.
D

What simplified principle describes the accounting rules of the HGB best?
A) „from the general to the specific “.
B) „from specific to general“.
C) „from difficult to obvious“.
D) The separation of all legal forms in special legal rules.
A

Are small commercial partnerships and individual merchants basically able to apply §§ 264 ff. HGB?
A) No, only §§ 238-263 HGB may (and need to) be applied.
B) No, only §§ 1-263 HGB may (and need to) be applied.
C) No, §§ 264 ff. HGB need to be applied. It is mandatory and not optional.
D) Basically yes, but it is voluntary; questionable concerning tax accrual (§ 274 HGB).
D

The Architecture-AG is ...
A) a merchant by definition (§ 1 HGB).
B) no merchant.
C) a merchant by legal form (§ 6 HGB).
D) a merchant by voluntary registration (§ 2 HGB).
C

The A-B-OHG, which practices extensive real estate businesses inland and abroad, is ...
A) a merchant by definition (§ 1 HGB).
B) no merchant.
C) a merchant by legal form (§ 6 HGB).
D) a merchant by voluntary registration (§ 2 HGB).
C

The culture-GmbH, which organizes exhibitions for unknown artists on a non-profit basis, is ...
A) a merchant by definition (§ 1 HGB).
B) no merchant.
C) a merchant by legal form (§ 6 HGB).
D) a merchant by voluntary registration (§ 2 HGB).
C

Otto Meier runs a small shop that opens just occasionally and which revenue is at most 10.000 € per financial year. He is ...
A) a merchant by definition (§ 1 HGB).
B) no merchant.
C) a merchant by legal form (§ 6 HGB).
D) a merchant by voluntary registration (§ 2 HGB).
B

Lawyer Hans Rechtslinks runs his law firm in Würzburg and generates a yearly revenue of 12.000.000 €. He is ...
A) a merchant by definition (§ 1 HGB).
B) no merchant.
C) a merchant by legal form (§ 6 HGB).
D) a merchant by voluntary registration (§ 2 HGB).
B

The Schnöller OHG that was founded just recently and is not registered in the commercial register so far and is (not yet) operating a commercial business, is ...
A) a merchant by definition (§ 1 HGB).
B) no merchant.
C) a merchant by legal form (§ 6 HGB).
D) a merchant by voluntary registration (§ 2 HGB).
B

Which principle is not an assignable framework principle of the generally accepted accounting principles?
A) Completeness
B) Prudence
C) Accuracy and Neutrality
D) Transparency and Understandability
B

Which principle is not an assignable accruals principles of the generally accepted accounting principles?
A) Imparity principle
B) Realization principle
C) Accruals principle
D) Single-asset valuation
D

Which principle is not an assignable complementary principle of the generally accepted accounting principles?
A) Consistency
B) Prudence
C) Imparity principle
D) Going concern
C

What is a sale of finished goods on credit for the selling company?
A) Cash-inflow, but no income.
B) No receipt, but an income.
C) Receipt, but no cash-inflow.
D) None of the above is correct.
C

Business accounting is seperated in different fields. What is not a part of the management (internal) accounting?
A) Budgeting
B) business accounting
C) Statistics and comparative methods
D) Cost- and performance accounting
B

Business accounting is seperated in different fields. What is not a part of the financial accounting?
A) Bookkeeping
B) Financial planning
C) Inventory
D) Financial statements
B

The generally accepted Accounting rules need to be taken into consideration for preparing the financial statements. What is not a part of the framework principles of the generally accepted Accounting rules?
A) Trancparancy and Understandability
B) Completeness
C) Prudence
D) Accuracy and Neutrality
C

The generally accepted Accounting rules need to be taken into consideration for preparing the financial statements. What is not a part of the accrual principles of the generally accepted Accounting rules?
A) Realization principle
B) Accruals principle
C) Completeness
D) Imparity principle
C

In which case is a cash-outflow an expenditure at the same time?
A) Purchase of goods on credit
B) Purchase of goods in cash
C) Payment of goods sold in a prior period
D) Delivery of goods that have been paid within a prior period
B
